In [22]:
import pandas as pd

In [23]:
data = {'ProductName':['Product A','Product B','Product C'], 'ProductPrice':[22250,16600,125200]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C        125200

In [24]:
data = {'ProductName':['Product A','Product B','Product C'], 'ProductPrice':[22250,16600,125200]}
df = pd.DataFrame(data,index = ['A','B','C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C        125200

In [25]:
data = {'ProductName':['Product A','Product B','Product C'], 'ProductPrice':[22250,16600,125200]}
productIDs = ['A','B','C']
df = pd.DataFrame(data,index = productIDs)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C        125200

In [26]:
data = [{'ProductName':'Product A','ProductPrice':22250},
        {'ProductName':'Product B','ProductPrice':16600},
        {'ProductName':'Product C','ProductPrice':12500}]
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [27]:
ser_product = pd.Series(['Product A','Product B','Product C'], index = ['A','B','C'])
ser_prices = pd.Series([22250,16600,12500], index  = ['A','B','C'])

In [28]:
data = {'ProductName':ser_product,'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [31]:
data = [['Product A',22250],['Product B',16600],['Product C',12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [33]:
df.column = ['ProductName','ProductPrice']
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [39]:
df = pd.DataFrame(data =[['Product A', 22250],['Product B',16600],['Product C',12500]],
                  columns = ['ProductName','ProductPrice'],
                  index = ['A','B','C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [40]:
df.shape

(3, 2)